# WallTaperedUseInstanceAngles Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallTaperedUseInstanceAngles Property
ParameterTypeId Class See Also
---
"Enable Angle Overrides"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallTaperedUseInstanceAngles { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallTaperedUseInstanceAngles As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallTaperedUseInstanceAngles {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace